;; -*- Mode: Emacs-Lisp ; Coding: utf-8 -*-

;;-----------------------------------------------------------------
;; set path
;;-----------------------------------------------------------------
(setq exec-path (cons "/opt/local/bin" exec-path))

;;-----------------------------------------------------------------
;; highlight-line
;;-----------------------------------------------------------------
;;(global-hl-line-mode)
;;(setq hl-line-face 'underline)

;;-----------------------------------------------------------------
;; highlight [],(),{}
;;-----------------------------------------------------------------
(show-paren-mode t)

;;-----------------------------------------------------------------
;; modify buffer name
;;-----------------------------------------------------------------
(require 'uniquify)
(setq uniquify-buffer-name-style 'post-forward-angle-brackets)

;;-----------------------------------------------------------------
;; set scroll step 1
;;-----------------------------------------------------------------
(setq scroll-step 1)

;;-----------------------------------------------------------------
;; backup config
;;-----------------------------------------------------------------
(setq backup-by-copying t)
(defadvice make-backup-file-name
  (around modify-file-name activate)
  (let ((backup-dir "~/.emacs.d/backup")) ;; 保存ディレクトリ
    (setq backup-dir (expand-file-name backup-dir))
    (unless (file-exists-p backup-dir)(make-directory-internal backup-dir))
    (if (file-directory-p backup-dir)
	(let* ((file-path (expand-file-name file))
	       (chars-alist '((?/ . (?#))(?# . (?# ?#))(?: . (?\;))(?\; . (?\; ?\;))))
	       (mapchars(lambda (c) (or (cdr (assq c chars-alist)) (list c)))))
	  (setq ad-return-value(concat backup-dir "/"(mapconcat 'char-to-string
								(apply 'append 
								       (mapcar mapchars file-path)) "")))) ad-do-it)))
;;-----------------------------------------------------------------
;; タブとインデント幅の設定
;;-----------------------------------------------------------------
;; タブ文字はスペース4文字分
;;(setq-default tab-width 4)
;;; TABを使わずに空白だけ
;;(setq indent-tabs-mode nil)

;; Tabの代わりにスペースでインデント
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4 indent-tabs-mode nil)
;; 前と同じ行の幅にインデント
(setq indent-line-function 'indent-relative-maybe)


;;-----------------------------------------------------------------
;; yes/noを、y/nで選択できるようにする。
;;-----------------------------------------------------------------
(fset 'yes-or-no-p 'y-or-n-p)

;;-----------------------------------------------------------------
;; kill-lineで行末の改行文字も削除
;;-----------------------------------------------------------------
;(setq kill-whole-line t)

;;-----------------------------------------------------------------
;; M-zをundoにバインド
;;-----------------------------------------------------------------
(global-set-key "\M-z" 'undo)

;;-----------------------------------------------------------------
;; C-hをBackSpaceにバインド (ヘルプはC-x C-hに)
;;-----------------------------------------------------------------
(global-set-key "\C-h" 'backward-delete-char)
(global-set-key "\C-x\C-h" 'help-command)

;;-----------------------------------------------------------------
;; Shift-cursor でフレーム移動
;;-----------------------------------------------------------------
;; (windmove-default-keybindings)
(setq windmove-wrap-around t)
(global-set-key (kbd "C-<right>") 'windmove-right)
(global-set-key (kbd "C-<left>") 'windmove-left)
(global-set-key (kbd "C-<up>") 'windmove-up)
(global-set-key (kbd "C-<down>") 'windmove-down)


;;-----------------------------------------------------------------
;; スタートアップメッセージ非表示
;;-----------------------------------------------------------------
(setq inhibit-startup-message t)

;;-----------------------------------------------------------------
;; バッファリストはウィンドウ分割しない
;;-----------------------------------------------------------------
(global-set-key "\C-x\C-b" 'buffer-menu)

;;-----------------------------------------------------------------
;; コピーしようとしてread-onlyなbufferをkillしてもエラーをださない
;;-----------------------------------------------------------------
(setq kill-read-only-ok t)

;;-----------------------------------------------------------------
;; コメント/アンコメント
;;-----------------------------------------------------------------
(global-set-key "\C-c\C-c" 'comment-or-uncomment-region)

;;-----------------------------------------------------------------
;; ビープ音を出さない
;;-----------------------------------------------------------------
(setq visible-bell t)

;;-----------------------------------------------------------------
;; occur-by-moccur
;;-----------------------------------------------------------------
(global-set-key "\C-co" 'occur-by-moccur)

;;-----------------------------------------------------------------
;; minibufferでC-wで前の単語を削除
;;-----------------------------------------------------------------
(define-key minibuffer-local-completion-map "\C-w" 'backward-kill-word)

;;-----------------------------------------------------------------
;; スクロールバー非表示
;;-----------------------------------------------------------------
(set-scroll-bar-mode nil)

;;-----------------------------------------------------------------
;; ツールバー非表示
;;-----------------------------------------------------------------
(tool-bar-mode 0)

;;-----------------------------------------------------------------
;; バッファ削除の際はウィンドウも
;;-----------------------------------------------------------------
(global-set-key "\C-xk" 'kill-buffer-and-window)

(ffap-bindings)
